Revit 2027 API
DisplacementElement.IsElementDisplacedInView Method
 Indicates if the specified element displaced in the specified View.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsElementDisplacedInView(
	View view,
	ElementId id
)
Public Shared Function IsElementDisplacedInView (
	view As View,
	id As ElementId
) As Boolean
public:
static bool IsElementDisplacedInView(
	View^ view,
	ElementId^ id
)
static member IsElementDisplacedInView :
        view : View *
        id : ElementId -> bool
Parameters
view View
 The view.
id ElementId
 The element id.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DisplacementElement Class
Autodesk.Revit.DB Namespace